Tekla Open API Reference for Tekla Structures 2025
PolycurveGeometryBuilder Constructor (Polycurve)
 Constructs a geometry builder from an existing geometry list
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PolycurveGeometryBuilder(
	Polycurve geometries
)
Public Sub New (
	geometries As Polycurve
)
Parameters
geometries
Type: Tekla.Structures.Geometry3d.Polycurve
Initial geometry list
See Also
Reference
PolycurveGeometryBuilder Class
PolycurveGeometryBuilder Overload
Tekla.Structures.Geometry3d Namespace